import re
from telethon import Button
from .. import callback, HNDLR

STRINGS = {
    1: """🎇 **مرحبًا بك في سورس النسرالاسود!** 
يبدو أنك قد اخترت الطريق الصحيح باستخدام النسرالاسود 😎

❃ إليك بعض التعليمات الأساسية للتعرف على سورس النسر الاسود.""",
    
    2: """🎉 **ما هو النسر الاسود؟**

🧿 تيبثون هو بوت يدمج أوامر مخصصه في حسابك الشخصي من خلال كود السيشن.  
 يعتبر تيبثون أول سورس مجاني وعربي مخصص لمنصة تيليجرام، يعتمد على مكتبة التيليثون
تم تطويره لإكمال العديد من المهام في حسابات تيليجرام الشخصية، مثل إدارة المجموعات، الرد التلقائي على الرسائل، وتنفيذ أوامر محددة.  
**سورس تيبثون هو الأفضل من حيث الخصوصية**، فلا يمكن حتى للمطور الوصول إلى حسابك، مما يضمن أمانك التام.

📢 مبرمج السورس **@SSSTlF**""",
    
    3: """💡 **فوائد استخدام سورس النسرالاسود:**
- إدارة حسابك بكفاءة وسهولة.
- الوصول إلى أوامر متعددة لتعزيز تجربتك.
- اوامر مميزة مجانية كلا للاحتكار
- تحديثات مستمرة و تخصيصات تناسبك بشكل تام 

🎉 **لا تنسى المشاركة!**
شارك معنا أفكارك واقتراحاتك مع المطور لتحسين الخدمة @SSSTlFd

📣 للبقاء على اطلاع بالتحديثات، تابع قناة السورس:
- انضم إلى @SSSTlFd""",
    
    4: f"""🔍 **كيفية الاستخدام:**
لعرض أوامر سورس النسرالاسود، فقط أرسل الأمر التالي:

- `{HNDLR}الأوامر`""",
    
    5: """⚠️ **تنبيه مهم:**
يرجى الانتباه إذا قام شخص آخر بتنصيب سورس تيبثون لك أو إذا كان هناك شخص يمتلك كود السيشن الخاص بك.  
فأن من يمتلك كود السيشن الخاص بك يمكنه التحكم في حسابك، لذا يجب عليك فورًا إنهاء جميع الجلسات وتنصيب سورس تيبثون بنفسك لضمان أمان لحسابك

🔒 **تذكير بالخصوصية:**
نحن نحترم خصوصيتك، ولن نقوم بمشاركة معلوماتك مع أي جهة خارجية.

💬 **للمساعدة، انضم إلى مجموعة الدعم: @SSSTlFd**

❃ شكرًا لك على قراءة المعلومات حتى النهاية! 🤍""",
}

@callback(re.compile("initft_(\\d+)"))
async def init_depl(e):
    CURRENT = int(e.data_match.group(1))
    if CURRENT == 5:
        return await e.edit(
            STRINGS[5],
            buttons=Button.inline("<< رجوع", "initbk_4"),
            link_preview=False,
        )

    await e.edit(
        STRINGS[CURRENT],
        buttons=[
            Button.inline("<<", f"initbk_{str(CURRENT - 1)}"),
            Button.inline(">>", f"initft_{str(CURRENT + 1)}"),
        ],
        link_preview=False,
    )

@callback(re.compile("initbk_(\\d+)"))
async def ineiq(e):
    CURRENT = int(e.data_match.group(1))
    if CURRENT == 1:
        return await e.edit(
            STRINGS[1],
            buttons=Button.inline("بدأ مجددًا", "initft_2"),
            link_preview=False,
        )

    await e.edit(
        STRINGS[CURRENT],
        buttons=[
            Button.inline("<<", f"initbk_{str(CURRENT - 1)}"),
            Button.inline(">>", f"initft_{str(CURRENT + 1)}"),
        ],
        link_preview=False,
    )
